document.addEventListener('DOMContentLoaded', function() {
    const urlParams = new URLSearchParams(window.location.search);
    const eventId = urlParams.get('id');
    // Объект с данными мероприятий
    const eventsData = {
        "1": {
            "title": "Великолепие корейских дорам в исполнении JAZI ORCHESTRA",
            "image": "images/Великолепие корейских дорам.png",
            "description": "Великолепие корейских дорам в исполнении JAZI ORCHESTRA!\n\nОщутите волшебство корейских дорам в новом свете на захватывающем концерте с виртуозным исполнением большого симфонического оркестра.\n\nОт нежных мелодий любви до энергичных тем борьбы за справедливость, каждая нота пробуждает в вас эмоции, словно вы сами становитесь героями ваших любимых сериалов таких, как: Потомки Солнца, Алые сердца корё, F4 - парни красивее цветов, Гоблин, Королева Чорин, Итэвон класс, Полный дом, Аварийная посадка любви, Ва-Банк, Пентхауc, Сказание о Кумихо.\n\nПогрузитесь в атмосферу волшебства и романтики, где музыка становится языком, объединяющим сердца и души всех поклонников корейской культуры.\n\nЭто мероприятие обещает быть незабываемым путешествием через величайшие моменты вашего любимого жанра.",
            "date": "13 июня 2024",
            "time": "17:00",
            "location": "г. Семей, ул. Б. Момышулы, 43, Городской дворец культуры",
            "price": "от 5000 тг",
            "parking": "есть",
            "genre": "концерт",
            "age_restriction": "12+"
        },
        "2": {
            "title": "Ұ-Night Show",
            "image": "images/Unight.png",
            "description": "Стэнд-ап, скетчтер, миниатюралар, музыкалық әзіл-сықақ және пародия! Осы қызықтардың барлығын «Ұ-Night Show» концертінде тамашалайтын боласыздар! Басты кейіпкерлер - өзіндік қайталанбас тіл орамына, менталитеті және өмірлік жағдайларға деген өздерінің бірегей көзқарасына ие әр алуан өңірлердің өкілдері. Көбіне мұндай ерекшеліктер мен айырмашылықтар көптеген түсініспеушіліктерге, тілдік келеңсіздіктерге, оғаш оқиғаларға және де, әрине, сан алуан әзілдерге негіз болатыны сөзсіз.",
            "date": "6 июня 2024",
            "time": "19:00",
            "location": "Семей қ., Семей қалалық мәдениет сарайы",
            "price": "от 2000 тг",
            "parking": "бар",
            "duration": "2 сағат",
            "age_restriction": "12+",
            "genre": "шоу"
        },
        "3": {
            "title": "JAZI Orchestra - Концерт Пацанских Саундтреков",
            "image": "images/Jazi.png",
            "description": "Пацанские саундтреки от JAZI ORCHESTRA! Приглашаем на концерт «Пацанских саундтреков» в исполнении «JAZI ORCHESTRA»! Специально для вас, на большой сцене Семея соберутся лучшие мастера музыкной индустрии. ДА БУДЕТ ШОУ! Видео сопровождение и световое шоу окунет вас в атмосферу настоящего мужского драйва в компании кино-героев Тарантино, Люка Бессона и других. Мы подготовили для вас программу саундтреков из фильмов: Перекрёсток, Джентельмены, Слово пацана, Криминальное чтиво, Бригада, Леон, Острые козырьки, Бумер, Брат 2, Крестный отец, От заката до рассвета, Бандитский Петербург и другие.",
            "date": "13 июня 2024",
            "time": "20:00",
            "location": "г. Семей, ул. Б. Момышулы, 43, Городской дворец культуры",
            "price": "от 5000 тг",
            "parking": "есть",
            "duration": "1 час 30 минут",
            "genre": "концерт",
            "age_restriction": "12+"
        },
        "4": {
            "title": "Миф об Атилле",
            "image": "images/Attila.png",
            "description": "«Где-то между Каспием и Аралом и родился будущий завоеватель мира Аттила, сын Мундзука, которому предстояло покорить 12 корон и 30 государств Европы и Азии». Аттила Мундзукулы, вождь гуннов, наш далекий предок, вдохновил на написание пьесы известного писателя из Семея Мурата Султанбекова. За постановку ее совместно с труппой театра имени Ф. М. Достоевского взялся столичный режиссер Уланмырза Карыпбаев. Отзвуки великих битв и грандиозных деяний, тени прошлого и думы о будущем воплотились на сцене в музыкальный и пластический спектакль, раскрывающий личность легендарного исторического деятеля с неожиданной стороны.",
            "date": "15 июня 2024",
            "time": "18:00",
            "location": "г. Семей Русский драматический театр им. Ф.М. Достоевского",
            "price": "от 3000 тг",
            "director": "Уланмырза Карыпбаев",
            "set_designer": "Ксения Бодрова",
            "choirmaster": "Сиргебаева Анель",
            "plastic_director": "Резида Гаянова /г. Санкт-Петербург/",
            "music_design": "Жуков Ярослав",
            "genre": "спектакль"
        },
        "5": {
            "title": "Шоу «СИНИЙ ТРАКТОР»",
            "image": "images/tracktor.png",
            "description": "Развивающее музыкальное шоу песенных хитов «Синего Трактора». Все дети любят «Синий трактор». А кто не любит, тот просто ещё не видел этих добрых, забавных мультфильмов-песен, полных запоминающихся шуток, которые с удовольствием повторяет вся семья. Синий трактор теперь и на сцене! Добрая шоу-сказка в мягком плюшевом формате для самых маленьких зрителей. Главный герой Синий Трактор гулял и потерялся. Его новые друзья - Профессор, Девочка Маша и Мальчик Петя - отправляются в полное приключений путешествие, чтобы найти его дом. В этой сказке нет злодеев, дети будут танцевать, смеяться и радоваться полностью позитивному представлению. Много интерактива в каждом номере шоу позволяет веселиться на всю катушку. Никаких границ между сценой и залом! Все тотально погружаются в действие, веселье доходит до дальних рядов благодаря специальному игровому реквизиту для каждого зрителя. Каждый ребенок почувствует себя важным и незаменимым. Концертное шоу «Синий трактор едет к нам» - идеальный вариант для первого знакомства малышей с театром!",
            "date": "1 июня 2024",
            "time": "12:00 и 15:00",
            "location": "г. Семей, Городской дворец культуры, ул. Б. Момышулы, 43",
            "price": "от 2000 тг",
            "duration": "55 минут",
            "parking": "есть",
            "age_restriction": "0+",
            "additional_info": "Детям до 3-х лет бесплатно без предоставления места.",
            "genre": "музыкальное шоу"
        },
        "6": {
            "title": "Қоштасқым келмейді. Семей қаласында",
            "image": "images/Astana to Semey.png",
            "description": "Трогательное и проникновенное выступление, которое не оставит равнодушным никого.",
            "date": "25 июня 2024",
            "time": "18:00",
            "location": "Абай атындағы қазақ музыкалық драма театры",
            "price": "от 3000 тг",
            "author": "А. Володин",
            "translated_by": "А. Маемиров",
            "premiere_date": "12.12.2023",
            "director": "А. Маемиров",
            "genre": "музыкалық драма",
            "age_restriction": "10+"
        },
        "7": {
            "title": "А.С. Пушкин: Моцарт и Сальери",
            "image": "images/mozartsaliery.png",
            "description": "«Моцарт и Сальери» - это лабораторная экспериментальная работа по исследованию совместимости гения и злодейства. Пушкин, назвав свой цикл «Маленькие трагедии», провел драматическое изучение этой темы, и создатели спектакля вслед за автором также лабораторным путем исследуют парадокс мироздания, но уже музыкально-драматическим путем. Ведь жанр постановки - SOUNDТРАГЕДИЯ, и музыка, в том числе музыка поэзии Пушкина - это не просто фон, а основа спектакля, среда обитания героев и зрителей.",
            "date": "10 июня 2024",
            "time": "18:00",
            "location": "Русский драматический театр",
            "price": "от 1500 тг",
            "director": "Рача Махатаев",
            "genre": "saundтрагедия",
            "duration": "2 часа",
            "age_restriction": "12+"
        },
        "8": {
            "title": "Енлик-Кебек",
            "image": "images/enlik-kebek.png",
            "description": "Спектакль «Енлик-Кебек» - трагедия раннего казахского общества. В основу произведения легла трагическая судьба настоящих влюбленных Енлик и Кебек. Они-два влюбленных, которые разорвали старые обычаи и соединились друг с другом по желанию сердца. Убитый суровым приговором чонжаров ру, отдавших дань степному закону, он заканчивается трагедией неприсоединения двух молодых людей.\n\nПроизведение «Енлик-Кебек» - начало казахского театрального искусства. В 1917 году пьеса М. Ауэзова впервые была поставлена на сцене юрты села Абай. Режиссером-постановщиком и суфлером спектакля был Мухтар Ауэзов.",
            "author": "Шакарим Кудайбердиевич, Магауия Абаевич, Мухтар Ауэзов",
            "director": "Жулдызбек Жуманбай",
            "genre": "трагедия",
            "date": "20 июня 2024",
            "time": "17:00",
            "location": "Городской дворец культуры",
            "price": "от 5000 тг"
        },
        "9": {
            "title": "Өз отыңды өшірме",
            "image": "images/oz oti.png",
            "description": "В произведении Оралхана Бокея «Өз отыңды өшірме» рассказывается о быте народа, о беспорядках в период становления советской власти, о самоотверженном подвиге простых трудящихся при строительстве железнодорожной магистрали Турксиб, которая повлекла за собой большие перемены в казахской степи.\n\nСценическая версия данного произведения создана для простого зрителя. Каждый образ в пьесе имеет свой нравственный идеал. Судьбы героев - это реальные судьбы людей, которые проявляют стойкость и честность на пути борьбы с несправедливостью.\n\nОгонь - это семья, Шанырак - дрова, важно не затушить собственный костер. Мы верим в это, пусть огонь веры не погаснет никогда!",
            "author": "Оралхан Бокей",
            "director": "Мейрам Хабибуллин",
            "artist": "Наталия Ерчихина",
            "genre": "пьеса",
            "date": "30 июня 2024",
            "time": "19:00",
            "location": "г. Семей, молодежный театр «Дарига-ай»",
            "price": "от 2000 тг"
        },
        
        "10": {
            "title": "The Greatest Hits",
            "image": "images/greatesthits.png",
            "description": "Концерт «The Greatest Hits» оркестра казахских народных инструментов имени Байжигита. Главный дирижер - «Мәдениет саласының үздігі» Шалкар Рысханов, дирижер - Ержан Касымканов, и вокально-инструментальный ансамбль «Әлем сазы», художественный руководитель - Мирас Туреханулы.\n\nВ концертной программе прозвучат популярные казахстанские и зарубежные хиты с участием ансамбля народного танца «Алтай», группы «Инкоро». В программе примут участие «Мәдениет саласының үздігі» Б. Жұмабекова и Ж. Бисимбаев, лауреаты республиканских и международных конкурсов: Т. Калекперов, Д. Толеужанов, Э. Уадинов, А. Ешенова, Р. Турсунбеков, А. Каирбек.",
            "date": "29 мая 2024",
            "time": "19:00",
            "duration": "1 час 30 минут",
            "location": "Дворец культуры города Семей",
            "age_restriction": "Нет",
            "genre": "концерт",
            "price": "от 3000 тг"
        },
        "11": {
            "title": "Гауһартас. Семей қаласында",
            "image": "images/Astana to Semey.png",
            "description": "«Гауһартас» қазақ даласындағы қарапайым шаруа шаңырағының қыр-сырын сонау 1975 жылдан бүгінгі күнге дейін жеткерген шығарма. Оқиға бір үйдің екі баласының екі түрлі тәрбиесі, бірінің қаталдығы, ал екіншісінің мейірімділігімен ерекшеленеді. Осындай отбасыға таң шапағатын сыйлаған Салтанаттың келін болып түсуі, оның әнге құмарлығы, жібектей мінезіне ата-енесінің дән риза болуы шығарманы ширата түседі. Шығармада екі жастың арасындағы махаббат қана емес, екі түрлі махаббат орын алады. Оның біріншісі Салтанаттың күйеуі Тастанға деген махаббаты болса, екіншісі Қайыркеннің жеңгесі Салтанатқа деген шексіз махаббаты еді...",
            "actors": {
                "Салтанат": "Инабат Ризабекова, Мақпал Дүйсен, Гүлдана Әбдісадық, Жансая Өмірбекова",
                "Тастан": "Оразалы Игілік, Сұлтан Кеңшілік, Мұхамедсаид Бағашаров, Аққанат Қуандықов",
                "Қайыркен": "Асылхан Төлепов, Дінислам Нұрмағамбетов, Дидар Төлегенов",
                "Әке": "Қазбек Есқара, Армат Амандықов",
                "Ана": "Майра Омар, Қалима Наушабаева, Дана Қабылова",
                "Әскербек": "Саламат Мұқашев, Ернар Мұхамбет, Әлихан Әлішер",
                "Дәрігер (әйел)": "Лаура Аязбаева",
                "Дәрігер (ер адам)": "Бибол Байғараев",
                "Балакүл жеңге": "Мөлдір Әбілтаева",
                "Райхан жеңге": "Жанель Есенгельдина",
                "Көпшілік сахнада": "театр артистер"
            },
            "location": "Семей, Абай атындағы қазақ музыкалық драма театры",
            "theater": "Астана қаласының Жас көрерменнің музыкалық театры",
            "author": "Дулат Исабеков",
            "premiere_date": "16-20 ақпан 2023 жыл",
            "director": "Асхат Маемиров",
            "genre": "музыкалық драма",
            "duration": "2 сағат 20 минут",
            "age_restriction": "10+",
            "date": "5 июня 2024",
            "time": "18:00",
            "price": "от 3500 тг"
        },
        
        "12": {
            "title": "Полуфинал плей-офф чемпионата Казахстана",
            "image": "images/polufinal.png",
            "description": "Дорогие болельщики футзала, жители и гости города Семей!\n\nФутзальный клуб «Семей» открывает продажу билетов на решающий домашний матч серии плей-офф полуфинала Чемпионата Казахстана. Игра пройдет на паркете «Абай Арены» 31 мая (пятница) в 19:30.\n\nНа всех домашних играх, как и всегда, болельщики смогут приобрести клубный мерч и посетить множественные зоны активностей как для детей, так и для взрослых. А также вы можете принять участие в различных розыгрышах призов. Приходите поддержать свою любимую команду и окунуться в мир футзальной страсти и состязаний.\n\nПросим вас приходить на мероприятие заранее, чтобы избежать очередей и обеспечить своевременное начало программы. Ваше своевременное прибытие поможет нам организовать комфортное и безопасное мероприятие для всех гостей.\n\nА также хотим сообщить, что в целях обеспечения вашей безопасности на территорию мероприятия запрещено проносить бутылки (пластиковые, стеклянные и другие). Пожалуйста, имейте в виду, что напитки допускаются только в бумажных и пластиковых стаканах.",
            "tournament": "Полуфинал плей-офф чемпионата Казахстана",
            "location": "г. Семей, Микрорайон Карагайлы, 39, «Арена»",
            "capacity": 5000,
            "date": "31 мая 2024 г.",
            "time": "19:30",
            "duration": "1 час 30 минут",
            "age_restriction": "0+",
            "genre": "футзал",
            "price": "от 4000 тг"
        },
        
        "13": {
            "title": "Абай-Тоғжан Семей қаласында",
            "image": "images/Astana to Semey.png",
            "description": "Адамзат тарихындағы біртуар тұлғалардың болмыс-бітіміндегі жасампаз рух балалық шақтан бастау алады. Жас ұрпақтың дүние танымына, жан дүниесіне, рухани болмысының қалыптасуына әсер ететін «Абай-Тоғжан» музыкалық драмасына Абай ғұмырының бозбала кезеңі арқау болды.\n\nЖас Абайдың жүрегінде оянған алғашқы махаббаты, көкірегінде туған тұңғыш жыры әуезді әнге айналып, ішкі сезім тебіреністерін аласапыран күйге салады. Тоғжанға деген іңкәр сезім өмірге деген құштарлыққа ұласып, Абайдың адамзатқа деген асқақ махаббатының темірқазығына айналды. Құнанбайдай әкенің тағылымы, Ұлжандай ананың өнегесі, қоршаған ортаның тылсым сыры, ғашықтықтың ғаламаты, дос пен бауырдың қадірі жас көрерменнің жанына рухани ләззат сыйлап, санасына көркем көзқарас қалыптастыруға ықпал етеді. Абай поэзиясындағы ойлы жырлар мен есті әндер орындалатын қойылымда ұлттымыздың құндылықтары сахна биігіне көтеріледі. Халықтық сана, ұлттық тәрбие, бабалар дәстүрі, ұлы дала ұлағаты ғашық Абайдың жан сүзгісінен өтіп, жас суреткерді «Сүйесің жүрек, күйесің» деген ұғымдарына қарай жетелей береді. Жас Абайдың әлемі көрерменге «Ғашықтың тілі тілсіз тіл» екендігін ұқтырады.",
            "actors": {
                "Абай": "Аян Өтепберген, Аман Ғұмаров, Дінислам Нұрмағанбетов, Дидар Төлеген",
                "Тоғжан": "Арелана Амангелдиева, Диана Асқар, Жансұлу Төлегенова",
                "Құнанбай": "Берік Айтжанов, Алтынбек Аманқұлов, Расул Усманов",
                "Ұлжан": "Самал Еслямова, Гүлдана Әбдісадық",
                "Оспан": "Асылхан Төлепов, Жасұлан Абдрахман"
            },
            "location": "Семей, Абай атындағы қазақ музыкалық драма театры",
            "author": "Мұхтар Әуезов, Инсценировка авторы Мирас Әбіл",
            "premiere_date": "14 желтоқсан 2020",
            "director": "Асхат Маемиров",
            "genre": "музыкалық драма",
            "duration": "1 сағ. 20 мин.",
            "age_restriction": "10+",
            "date": "12 июня 2024",
            "time": "17:00",
            "price": "от 4500 тг"
        }
        
    };
    
    // Функция для установки текста элемента или скрытия, если текста нет
    function setElementTextOrHide(elementId, text) {
        const element = document.getElementById(elementId);
        const wrapper = document.getElementById(`${elementId}-wrapper`);
        if (text) {
            element.textContent = text;
        } else {
            wrapper.style.display = 'none';
        }
    }

    // Проверяем, существуют ли данные для данного события
    if (eventsData && eventsData[eventId]) {
        document.getElementById('buy-ticket-button').setAttribute('data-event-id', eventId);
        const event = eventsData[eventId];

        // Устанавливаем данные мероприятия на странице
        document.getElementById('event-title').textContent = event.title;
        document.getElementById('event-image').src = event.image;
        document.getElementById('event-image').alt = event.title;
        document.getElementById('event-description').textContent = event.description;
        
        // Устанавливаем или скрываем дополнительные данные мероприятия
        setElementTextOrHide('event-date', event.date);
        setElementTextOrHide('event-time', event.time);
        setElementTextOrHide('event-location', event.location);
        setElementTextOrHide('event-price', event.price);
        setElementTextOrHide('event-parking', event.parking);
        setElementTextOrHide('event-duration', event.duration);
        setElementTextOrHide('event-age-restriction', event.age_restriction);
        setElementTextOrHide('event-genre', event.genre);
        setElementTextOrHide('event-tournament', event.tournament);
        setElementTextOrHide('event-capacity', event.capacity);
        setElementTextOrHide('event-author', event.author);
        setElementTextOrHide('event-premiere-date', event.premiere_date);
        setElementTextOrHide('event-director', event.director);

        // Устанавливаем или скрываем информацию об актерах
        if (event.actors) {
            let actorsHTML = '';
            for (const [role, names] of Object.entries(event.actors)) {
                actorsHTML += `<p><strong>${role}:</strong> ${names}</p>`;
            }
            document.getElementById('event-actors').innerHTML = actorsHTML;
        } else {
            document.getElementById('event-actors-wrapper').style.display = 'none';
        }
    } else {
        // Если событие не найдено, отображаем сообщение об ошибке
        document.querySelector('.event-detail').innerHTML = '<p>Мероприятие не найдено.</p>';
    }
});
